In [1]:
import database_handler
from lookups import Types, PandasFunctions
from pandas_handler import pandas_function
from csv_handler import get_csv_files_as_list

In [2]:
session = database_handler.create_connection()

In [3]:
session = database_handler.refresh_connection(session)

In [4]:
# testing return_as_df with query
countries = """
    SELECT se_country.country
    FROM public.country se_country
"""
query_df = database_handler.return_as_df(data_source=countries,file_type=Types.SQL,session = session)
query_df.head(3)

c:\Users\olasm\Desktop\FSD - July 2023\week 5\Python-Conditions-Error-handling\Ola_ETL_Proj\database_handler.py:48: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return_df = pd.read_sql_query(con = session, sql = data_source)

          country
0     Afghanistan
1         Algeria
2  American Samoa

In [5]:
# testing return_as_df with csv file
csv_df = database_handler.return_as_df(data_source='csv_files\Dim Customer.csv',file_type=Types.CSV)
csv_df.head()

  Customer ID    Customer Name
0    CG-12520      Claire Gute
1    DV-13045  Darrin Van Huff
2    SO-20335   Sean O'Donnell
3    BH-11710  Brosina Hoffman
4    AA-10480     Andrew Allen

In [6]:
# testing return_as_df handling errors
query_error = database_handler.return_as_df("SELECT * FROM no_table",Types.SQL,session)

Error: can't return sql query, Execution failed on sql 'SELECT * FROM no_table': relation "no_table" does not exist
LINE 1: SELECT * FROM no_table
                      ^

c:\Users\olasm\Desktop\FSD - July 2023\week 5\Python-Conditions-Error-handling\Ola_ETL_Proj\database_handler.py:48: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return_df = pd.read_sql_query(con = session, sql = data_source)

In [7]:
actors = """
    SELECT se_actor.last_name
    FROM public.actor se_actor
    LIMIT 5
"""
query2 = database_handler.return_query(session,actors)
query2

[('Crowe',), ('Dunst',), ('Degeneres',), ('Nolte',), ('Dern',)]

In [8]:
# testing successful execute_query
get_actor_name ="""
    UPDATE public.actor
    SET first_name = UPPER(first_name)
"""
database_handler.execute_query(session,get_actor_name)

Executed Successfully,

In [9]:
# testing error handling of execute_query
get_actor_name ="""
    UPDATE public.actor1
    SET first_name = UPPER(first_name)
"""
database_handler.execute_query(session,get_actor_name)

Error executing query, relation "public.actor1" does not exist
LINE 2:     UPDATE public.actor1
                   ^

In [11]:
# testing get_schema_information function
info_df = database_handler.get_schema_information(session)
info_df.head(2)

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,dvd_rental,public,actor,last_name,3,None,NO,character varying,45.0,180.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,dvd_rental,public,category,name,2,None,NO,character varying,25.0,100.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES

In [ ]:
# testing pandas_function
#pandas_function(info_df,PandasFunctions.GET_BLANKS)
#pandas_function(info_df,PandasFunctions.GET_LENGTH)
#pandas_function(info_df,PandasFunctions.REMOVE_DUPLICATES)
#pandas_function(info_df,PandasFunctions.REMOVE_NULLS)
pandas_function(info_df,PandasFunctions.GET_SHAPE)

(134, 44)

In [ ]:
# testing error handling
pandas_function(query2,PandasFunctions.REMOVE_NULLS)

Error removing null values, 'list' object has no attribute 'dropna'

In [ ]:
get_csv_files_as_list()

['Dim Customer.csv',
 'Dim Location.csv',
 'Dim Product.csv',
 'Dim SalesPerson.csv',
 'Fact Purchase.csv']

In [ ]:
database_handler.close_connection(session)